{
  "english": {
    "topBtn": "Top",
    "aboutBtn": "About",
    "resumeBtn": "Resume",
    "projectsBtn": "Projects",
    "welcomeText": "Hi, I am <span class='text-highlights'>Dawid Szymański</span>",
    "aboutMeHeader": "About Me",
    "aboutMeText1": "I am a 26 year old curently living and working in <span class='text-highlights'>Warsaw</span>, together with my girlfriend and two dogs.",
    "aboutMeText2": "I have spend majority of my teenage years living abroad in <span class='text-highlights'>United Kingdom</span> where I learned <span class='text-highlights'>english</span> and studied software development at <span class='text-highlights'>Uxbridge College</span>.",
    "aboutMeText3": "My last 6 months were focused on speding most of my free time to study programming and build my own projects in order to achieve my <span class='text-highlights'>goal of a career in programming</span>.",
    "resumeHeader": "Resume",
    "resumeTextRight1": "Throughout my programming journey I have accumulated knowledge of using various frameworks, languages and libraries:",
    "resumeListHeader1": "Web Development",
    "resumeTextList1": "SASS (basics)",
    "resumeTextList2": "jQuery (basics)",
    "resumeTextList3": "Bootstrap (basics)",
    "resumeListHeader2": "Databases",
    "projectsHeader": "Projects",
    "project1Header": "Portfolio Website",
    "project1Text1": "I have created this very website to display my Front-End Development skills and have my own place to add everything that involve my employment history and current programming abilities.",
    "project1Text2": "My focus was on using basic Web Development languages such as HTML, CSS and JavaScript. Additionally, I have used a Font Awesome library for icons with variousanimation and Google Fonts. Additionally I have focused on making all of these features work together for a Responsive Web Design which is a staple of Web Development.",
    "project1Text3": "This website contains light/dark mode switch and language change which are common practices that help appeal to wider range of users.",
    "project1Label1": "Dark/Light Mode",
    "project1Label2": "Two Languages",
    "project1Label3": "Hyperlink Buttons",
    "project1Tech": "Technologies used for this Project:",
    "project2Header": "Employee Management App",
    "project2Text1": "This application is a display of my Full Stack Development skills and it is a basic version of employee management software that could be used in HR department.",
    "project2Text2": "It allows user to create/edit/delete data that automatically updates in a SQL Database. There is also an option to view the main Employee table inside Windows Forms that updates all records with a press of Refresh Button and allows the user to search any specific phrases inside the table.",
    "project2Text3": "Design has been focused on minimalism and readability as I believe this type of app should focus on simplicity and performance rather than graphics and animations that will slow the program and reduce efficiency of person using it.",
    "project2Label1": "Updade Entries / Refresh Main Table",
    "project2Label2": "Delete an Entry",
    "project2Label3": "Works with a SQL Database",
    "project2Tech": "Technologies used for this Project:",
    "projectHoverInfo": "Hover over / click GIFs for zoom.",
    "projectBtn1":"Portfolio Website",
    "projectBtn2":"Employee Management App"
  },
  
  "polish": {
    "topBtn": "Góra",
    "aboutBtn": "O mnie",
    "resumeBtn": "CV",
    "projectsBtn": "Projekty",
    "welcomeText": "Cześć, jestem <span class='text-highlights'>Dawid Szymański</span>",
    "aboutMeHeader": "O mnie",
    "aboutMeText1": "Mam 26 lat, obecnie mieszkam i pracuję w <span class='text-highlights'>Warszawie</span>, razem z moją dziewczyną i dwoma psami.",
    "aboutMeText2": "Większość mojej młodości spędziłem za granicą - w <span class='text-highlights'>Wielkiej Brytanii</span>, gdzie nauczyłem się <span class='text-highlights'>języka angielskiego</span> i studiowałem tworzenie systemów komputerowych w <span class='text-highlights'>Uxbridge College</span>.",
    "aboutMeText3": "Ostatnie 6 miesięcy, w wolnym czasie, poświęciłem na naukę programowania i tworzenie własnych projektów, aby osiągnąć swój <span class='text-highlights'>cel kariery w programowaniu</span>.",
    "resumeHeader": "CV",
    "resumeTextRight1": "Podczas mojej przygody z programowaniem zdobyłem wiedzę z różnych frameworków, języków i bibliotek, m.in.:",
    "resumeListHeader1": "Tworzenie Stron Internetowych",
    "resumeTextList1": "SASS (podstawy)",
    "resumeTextList2": "jQuery (podstawy)",
    "resumeTextList3": "Bootstrap (podstawy)",
    "resumeListHeader2": "Bazy Danych",
    "projectsHeader": "Projekty",
    "project1Header": "Strona Portfolio",
    "project1Text1": "Stworzyłem tę stronę internetową, aby pokazać moje umiejętności w zakresie Front-End development oraz, żeby mieć miejsce, gdzie mogę umieścić wszystkie informacje dotyczące mojego doświadczenia zawodowego i moich umiejętności programistycznych.",
    "project1Text2": "Moim celem było wykorzystanie podstawowych języków tworzenia stron internetowych, takich jak HTML, CSS i JavaScript. Poza językami użyłem również bibliotekę Font Awesome dla ikon iróżnych animacji oraz czcionki Google Fonts. Dodatkowo skupiłem się na ukazaniu, że wszystkie te funkcje współpracują ze sobą w celu stworzenia Responsive Web Design, co jest podstawą tworzenia stron internetowych.",
    "project1Text3": "Ta strona internetowa zawiera przełącznik trybu jasnego/ciemnego i zmianę języka - są to powszechnie stosowane praktyki, które przyciągają szersze grono użytkowników.",
    "project1Label1": "Tryb Ciemny/Jasny",
    "project1Label2": "Dwa Języki",
    "project1Label3": "Przyciski Hiperłączy",
    "project1Tech": "Technologie wykorzystane w tym Projekcie:",
    "project2Header": "Aplikacja do Zarządzania Pracownikami",
    "project2Text1": "Ta aplikacja jest przykładem moich umiejętności Full Stack Development i jest podstawową wersją oprogramowania do zarządzania pracownikami, które mogłoby być używane w dziale HR.",
    "project2Text2": "Umożliwia użytkownikowi tworzenie/edycję/usuwanie danych, które automatycznie aktualizują się w bazie danych SQL. Istnieje również opcja wyświetlenia głównej tabeli pracowników w Windows Forms, która aktualizuje wszystkie dane po naciśnięciu przycisku Refresh i pozwala użytkownikowi wyszukiwać określone frazy w tabeli.",
    "project2Text3": "Projekt jest minimalistyczny i czytelny, ponieważ uważam, że tego rodzaju aplikacje powinny skupiać się na prostocie i wydajności, a nie na grafice i animacjach, które spowolnią program i zmniejszą wydajność osoby korzystającej z aplikacji.",
    "project2Label1": "Aktualizuj wpisy / Odśwież tabelę",
    "project2Label2": "Usuń wpis",
    "project2Label3": "Działa z bazą danych SQL",
    "project2Tech": "Technologie wykorzystane w tym Projekcie:",
    "projectHoverInfo": "Najedź kursorem / kliknij GIFy aby powiększyć.",
    "projectBtn1":"Strona Portfolio",
    "projectBtn2":"Aplikacja do Zarządzania Pracownikami"
  }
}