{
    "topBtn": "Góra",
    "aboutBtn": "O mnie",
    "resumeBtn": "CV",
    "projectsBtn": "Projekty",
    "welcomeText": "Cześć, jestem <span class='text-highlights'>Dawid Szymański</span>",
    "aboutMeHeader": "O mnie",
    "aboutMeText1": "Mam 26 lat, obecnie mieszkam w rodzinnej miejscowości <span class='text-highlights'>Lidzbark</span>.",
    "aboutMeText2": "Większość mojej młodości spędziłem za granicą - w <span class='text-highlights'>Wielkiej Brytanii</span>, gdzie nauczyłem się <span class='text-highlights'>języka angielskiego</span> i studiowałem tworzenie systemów komputerowych w <span class='text-highlights'>Uxbridge College</span>.",
    "aboutMeText3": "Ostatnie 12 miesięcy, w wolnym czasie, poświęciłem na naukę programowania i tworzenie własnych projektów, aby osiągnąć swój <span class='text-highlights'>cel kariery w programowaniu</span>.",
    "resumeHeader": "CV",
    "resumeTextRight1": "Podczas mojej przygody z programowaniem zdobyłem wiedzę z różnych frameworków, języków i bibliotek, m.in.:",
    "resumeListHeader1": "Tworzenie Stron Internetowych",
    "resumeTextList1": "SASS, Bootstrap, jQuery (podstawy)",
    "resumeListHeader2": "Bazy Danych",
    "projectsHeader": "Projekty",
    "project1Header": "Strona Portfolio",
    "project1Text1": "Stworzyłem tę stronę internetową, aby pokazać moje umiejętności w zakresie Front-End development oraz, żeby mieć miejsce, gdzie mogę umieścić wszystkie informacje dotyczące mojego doświadczenia zawodowego i moich umiejętności programistycznych.",
    "project1Text2": "Moim celem było wykorzystanie nabytej wiedzy biblioteki React.js dla nowoczesnego podejścia w porównaniu z pierwszą wersją projektu, która bazowała na podstawowym HTML+CSS+JS. Poza językami użyłem również bibliotekę Font Awesome dla ikon iróżnych animacji oraz czcionki Google Fonts. Dodatkowo skupiłem się na ukazaniu, że wszystkie te funkcje współpracują ze sobą w celu stworzenia Responsive Web Design, co jest podstawą tworzenia stron internetowych.",
    "project1Text3": "Ta strona internetowa zawiera przełącznik trybu jasnego/ciemnego i zmianę języka - są to powszechnie stosowane praktyki, które przyciągają szersze grono użytkowników.",
    "project1Label1": "Tryb Ciemny/Jasny",
    "project1Label2": "Dwa Języki",
    "project1Label3": "Przyciski Hiperłączy",
    "project2Header": "Aplikacja do Zarządzania Pracownikami",
    "project2Text1": "Ta aplikacja jest przykładem moich umiejętności Full Stack Development i jest podstawową wersją oprogramowania do zarządzania pracownikami, które mogłoby być używane w dziale HR.",
    "project2Text2": "Umożliwia użytkownikowi tworzenie/edycję/usuwanie danych, które automatycznie aktualizują się w bazie danych SQL. Istnieje również opcja wyświetlenia głównej tabeli pracowników w Windows Forms, która aktualizuje wszystkie dane po naciśnięciu przycisku Refresh i pozwala użytkownikowi wyszukiwać określone frazy w tabeli.",
    "project2Text3": "Projekt jest minimalistyczny i czytelny, ponieważ uważam, że tego rodzaju aplikacje powinny skupiać się na prostocie i wydajności, a nie na grafice i animacjach, które spowolnią program i zmniejszą wydajność osoby korzystającej z aplikacji.",
    "project2Label1": "Aktualizuj wpisy / Odśwież tabelę",
    "project2Label2": "Usuń wpis",
    "project2Label3": "Działa z bazą danych SQL",
    "project3Header": "Sklep Internetowy",
    "project3Text1": "Oto mój sklep internetowy stworzony przy użyciu nowo nabytych umiejętności Full Stack, z interaktywnym Front-End'owym systemem menu oraz Back-End'owym systemem magazynowym.",
    "project3Text2": "Chciałem doskonalić moje umiejętności w React.js, aby stworzyć szybką stronę opartą na komponentach, a także użyłem biblioteki Mongoose do utworzenia bazy danych MongoDB przechowującej informacje o wszystkich produktach i ich ilościach na magazynie. Skorzystałem również z wielu bibliotek, takich jak MaterialUI do wielu prezentowanych obiektów, ContextAPI do zarządzania stanem aplikacji i React Render do nawigacji między stronami.",
    "project3Text3": "Kliknij tutaj, aby odwiedzić mój sklep internetowy.",
    "project3Label1": "Filtrowanie kategoriami",
    "project3Label2": "Funkcjonalny system magazynowy",
    "project3Label3": "Tryb Ciemny/Jasny.",
    "projectTech": "Technologie wykorzystane w tym Projekcie:",
    "projectHoverInfo": "Najedź kursorem / kliknij GIFy aby powiększyć.",
    "projectBtn1":"Strona Portfolio",
    "projectBtn2":"Aplikacja do Zarządzania Pracownikami",
    "projectBtn3":"Sklep Internetowy"
  }